/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_is_vaild_num.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: miwasa <miwasa@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/09/21 23:21:38 by miwasa            #+#    #+#             */
/*   Updated: 2024/09/22 00:59:43 by miwasa           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "dictionary.h"

int	ft_is_valid_num(char *str)
{
	if (!str)
		return (0);
	// 空白のスキップ
	while (*str == ' ' || (*str >= 9 && *str <= 13))
		str++;
	// 符号の確認
	if (*str == '-' || *str == '+')
		str++;
	// 最初の数字が有効か確認
	if (*str < '0' || *str > '9')
		return (0);
	// 数字の確認
	while (*str >= '0' && *str <= '9')
		str++;
	// 末尾が有効か確認
	if (*str != '\0')
		return (0);
	return (1);
}
